tap "homebrew/bundle"

# https://github.com/ohmyzsh/ohmyzsh/wiki/Installing-ZSH
brew "zsh"

# https://www.vim.org/
brew "vim"

# https://github.com/sharkdp/bat
brew "bat"

# https://github.com/jqlang/jq
brew "jq"

# https://www.gnu.org/software/stow/
brew "stow"

# https://htop.dev/
brew "htop"

# https://github.com/casey/just
brew "just"

# fzf: A command-line fuzzy finder
# https://github.com/junegunn/fzf
brew "fzf"

# yq: A portable command-line YAML, JSON, XML, CSV, TOML and properties processor
# https://github.com/mikefarah/yq
brew "yq"

# xq: Command-line XML and HTML beautifier and content extractor
# https://github.com/sibprogrammer/xq
brew "xq"

# pre-commit: A framework for managing and maintaining multi-language pre-commit hooks.
# https://pre-commit.com/
brew "pre-commit"

# golang
brew "go"

# https://golangci-lint.run/welcome/install/
brew "golangci-lint"

# https://github.com/gnachman/iTerm2
cask "iterm2"

# https://github.com/microsoft/vscode
cask "visual-studio-code"
vscode "bierner.emojisense"
vscode "ms-vscode-remote.remote-containers"

# https://rancherdesktop.io/
cask "rancher"

# https://docs.dagger.io/
brew "dagger/tap/dagger"
